results/ryzen9-7950x-node0/e2e-v2/runs/f-h2-arena-heap/h2load.txt
starting benchmark...
spawning thread #0: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #1: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #2: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #3: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #3.
Warm-up started for thread #Warm-up started for thread #2.
1.
progress: 25% of clients started
progress: 50% of clients started
progress: 75% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #2.
Warm-up phase is over for thread #1Warm-up phase is over for thread #3.Main benchmark duration is started for thread #
2.
.
Main benchmark duration is started for thread #1.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Application protocol: h2c
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 20.00s, 676927.60 req/s, 2.28GB/s
requests: 13538552 total, 13539064 started, 13538552 done, 13538552 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 13538552 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 45.67GB (49038883263) total, 12.91MB (13538552) headers (space savings 90.00%), 45.19GB (48523985537) data
                     min         max         mean         sd        +/- sd
time for request:      324us     82.85ms       709us       916us    99.18%
time for connect:        8us        78us        41us        24us    50.00%
time to 1st byte:    66.92ms     73.16ms     69.94ms      3.07ms    81.25%
req/s           :   41965.54    42575.76    42307.69      215.13    50.00%